sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_mjenc.c
#include "bl808_mjenc.h"
#include "mjenc_reg.h"
#include "mjenc_q_sram_reg.h"

#undef  DEBUG_MODULE
#define DEBUG_MODULE 0

//#define DEBUG_QTABLE

#define BL_BIT_SET(val, bit)    val | (1 << bit)

void MJENC_Init(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_MJPEG_BIT_ORDER);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_ORDER_U_EVEN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_W_XLEN, AXI_XLEN_INCR16);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_MJPEG_ENABLE);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);

    /* sw mode related */
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_MJPEG_SW_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_MJPEG_SW_RUN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_SW_FRAME, 10);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_MJPEG_WAIT_CYCLE, 400);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2, tmpVal);

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_3);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_NORMAL_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_INT_CAM_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_INT_MEM_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_FRAME_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_IDLE_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_FRAME_CNT_TRGR_INT, 1);  /* trigger interrupt every frame */
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_3, tmpVal);

#if (MJPG_AUTO_HEADER)
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_HEADER_BYTE);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_TAIL_EXP);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_HEADER_BYTE, tmpVal);
#endif
}

void MJENC_SetHeaderSize(uint32_t size)
{
#if (MJPG_AUTO_HEADER)
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_HEADER_BYTE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_HEAD_BYTE, size);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_HEADER_BYTE, tmpVal);
#endif
}

void MJENC_SetResolution(const MJPEG_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
    if (IS_MULTIPULE_OF_16(cfg->height)) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_LAST_HF_HBLK_DMY);
#if (BL80X_HW_VER >= BL80X_HW_B0)
        tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_REFLECT_DMY);
#endif
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_LAST_HF_HBLK_DMY);
#if (BL80X_HW_VER >= BL80X_HW_B0)
        tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_REFLECT_DMY);
#endif
    }
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);

    /* resolution related */
#if (BL80X_HW_VER <= BL80X_HW_A0)
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_FRAME_WBLK, BLK_CNT_16X16(cfg->width));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_FRAME_HBLK, BLK_CNT_16X16(cfg->height));
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);
#else
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_FRAME_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_FRAME_WBLK, BLK_CNT_16X16(cfg->width));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_FRAME_HBLK, BLK_CNT_16X16(cfg->height));
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_FRAME_SIZE, tmpVal);
#endif
}

void MJENC_SetSrcChannel(MJPEG_Src_Chann_Cfg_Type *portCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_YY_DVP2AXI_SEL, portCfg->y_src);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_UV_DVP2AXI_SEL, portCfg->uv_src);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2, tmpVal);
}

void MJENC_SetSrcBuf_Y(uint32_t bufAddr, uint16_t blkRowCnt)
{
    uint32_t tmpVal;

    /* check if buffer is aligned to 128 bytes boundary */
    CHECK_PARAM((bufAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );

    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_YY_FRAME_ADDR, bufAddr);

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_YUV_MEM);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_YY_MEM_HBLK, blkRowCnt);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_YUV_MEM, tmpVal);
}

void MJENC_SetSrcBuf_UV(uint32_t bufAddr, uint16_t blkRowCnt)
{
    uint32_t tmpVal;

    /* check if buffer is aligned to 128 bytes boundary */
    CHECK_PARAM((bufAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );

    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_UV_FRAME_ADDR, bufAddr);

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_YUV_MEM);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_UV_MEM_HBLK, blkRowCnt);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_YUV_MEM, tmpVal);
}

void MJENC_SetBitstreamBuf(uint32_t bufAddr, uint32_t bufSize)
{
    /* check if buffer is aligned to 128 bytes boundary */
    CHECK_PARAM((bufAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );

    BL_WR_REG(MJPEG_ENC_BASE, MJENC_JPEG_FRAME_ADDR, bufAddr);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_JPEG_STORE_MEMORY, Mem_Size_To_Burst_Cnt(bufSize, AXI_XLEN_INCR16));
}

void MJENC_SetQuality(MJPEG_Quant_Mode_Type quality)
{
#if 0
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_Q_MODE, quality);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);
#endif
}

/* FSM for MJPEG encoder
    stop / done with sw_frame_num -> flush state -> idle state -> check sw_mode ->
        0: check mjpeg_enable
            1: -> function state 
        1: set state (ignore mjpeg_enable)-> check sw run
            1: -> sw run state 
*/
void MJENC_StartEnc(MJPEG_Enc_Mode_Type mode)
{
    uint32_t tmpVal;
    if (MJPEG_ENC_SNAPSHOT_MODE == mode) {
        /* enter function state */
        tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
        tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_MJPEG_ENABLE);

#if (BL80X_HW_VER >= BL80X_HW_B0)
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_MJPEG_HW_FRAME, 1);  /* 1 frame only */
#endif
        BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);
    } else if (MJPEG_ENC_AUTO_MODE == mode) {
        /* enter function state */
        tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
        tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_MJPEG_ENABLE);
#if (BL80X_HW_VER >= BL80X_HW_B0)
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_MJPEG_HW_FRAME, 0);  /* non-stop */
#endif
        BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);
    } else {
        /* enter sw set state */
        tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2);
        tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_MJPEG_SW_MODE);
        BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2, tmpVal);

        /* enter sw run state */
        tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_MJPEG_SW_RUN);
        tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_MJPEG_SW_MODE);
        BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_2, tmpVal);
    }
}

void MJENC_StopEnc(void)
{
    uint32_t tmpVal;

    /* enter function state */
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJENC_REG_MJPEG_ENABLE);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_1, tmpVal);
}

