sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_mjenc.c
void MJENC_PopStreamFifo(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_FRAME_FIFO_POP);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_RFIFO_POP);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_FRAME_FIFO_POP, tmpVal);
}

void MJENC_ClearIntrFlag(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_FRAME_FIFO_POP);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_NORMAL_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_CAM_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_MEM_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_FRAME_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJENC_REG_INT_IDLE_CLR);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_FRAME_FIFO_POP, tmpVal);
}

#ifdef DEBUG_QTABLE
void MJENC_Qtable_debug(uint32_t tmpVal)
{
    static int index = 0;
    BL_LOGI("[%d]:%d\r\n", 2*index, tmpVal&0x0000ffff);
    BL_LOGI("[%d]:%d\r\n", 2*index + 1, tmpVal>>16);
    index++;
}
#endif

void MJENC_SetQTableOffset0(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_00);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_00, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_01, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_00, tmpVal);
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_00);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_00));
#endif

}

void MJENC_SetQTableOffset1(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_02);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_02, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_03, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_02, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_02));
#endif
}

void MJENC_SetQTableOffset2(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_04);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_04, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_05, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_04, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_04));
#endif

}

void MJENC_SetQTableOffset3(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_06);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_06, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_07, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_06, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_06));
#endif
}

void MJENC_SetQTableOffset4(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_08);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_08, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_09, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_08, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_08));
#endif
}

void MJENC_SetQTableOffset5(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_0A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_0B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0A));
#endif

}

void MJENC_SetQTableOffset6(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_0C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_0D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0C));
#endif
}

void MJENC_SetQTableOffset7(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_0E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_0F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_0E));
#endif
}

void MJENC_SetQTableOffset8(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_10);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_10, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_11, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_10, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_10));
#endif
}

void MJENC_SetQTableOffset9(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_12);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_12, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_13, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_12, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_12));
#endif
}

void MJENC_SetQTableOffset10(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_14);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_14, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_15, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_14, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_14));
#endif
}

void MJENC_SetQTableOffset11(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_16);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_16, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_17, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_16, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_16));
#endif
}

void MJENC_SetQTableOffset12(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_18);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_18, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_19, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_18, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_18));
#endif
}

void MJENC_SetQTableOffset13(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_1A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_1B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1A));
#endif
}

void MJENC_SetQTableOffset14(int val1, int val2)
{
    uint32_t tmpVal;

