sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_mjenc.c
    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_1C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_1D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1C));
#endif
}

void MJENC_SetQTableOffset15(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_1E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_1F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_1E));
#endif
}

void MJENC_SetQTableOffset16(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_20);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_20, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_21, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_20, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_20));
#endif
}

void MJENC_SetQTableOffset17(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_22);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_22, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_23, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_22, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_22));
#endif
}

void MJENC_SetQTableOffset18(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_24);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_24, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_25, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_24, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_24));
#endif
}

void MJENC_SetQTableOffset19(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_26);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_26, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_27, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_26, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_26));
#endif
}

void MJENC_SetQTableOffset20(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_28);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_28, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_29, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_28, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_28));
#endif
}

void MJENC_SetQTableOffset21(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_2A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_2B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2A));
#endif
}

void MJENC_SetQTableOffset22(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_2C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_2D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2C));
#endif
}

void MJENC_SetQTableOffset23(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_2E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_2F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_2E));
#endif
}

void MJENC_SetQTableOffset24(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_30);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_30, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_31, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_30, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_30));
#endif
}

void MJENC_SetQTableOffset25(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_32);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_32, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_33, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_32, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_32));
#endif
}

void MJENC_SetQTableOffset26(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_34);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_34, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_35, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_34, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_34));
#endif
}

