sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_mjenc.c
void MJENC_SetQTableOffset27(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_36);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_36, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_37, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_36, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_36));
#endif
}

void MJENC_SetQTableOffset28(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_38);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_38, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_39, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_38, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_38));
#endif
}

void MJENC_SetQTableOffset29(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_3A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_3B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3A));
#endif
}

void MJENC_SetQTableOffset30(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_3C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_3D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3C));
#endif
}

void MJENC_SetQTableOffset31(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_3E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_0_3F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_3E));
#endif
}

void MJENC_SetQTableOffset32(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_40);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_00, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_01, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_40, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_40));
#endif
}

void MJENC_SetQTableOffset33(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_42);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_02, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_03, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_42, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_42));
#endif
}

void MJENC_SetQTableOffset34(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_44);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_04, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_05, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_44, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_44));
#endif
}

void MJENC_SetQTableOffset35(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_46);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_06, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_07, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_46, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_46));
#endif
}

void MJENC_SetQTableOffset36(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_48);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_08, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_09, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_48, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_48));
#endif
}

void MJENC_SetQTableOffset37(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_0A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_0B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4A));
#endif
}

void MJENC_SetQTableOffset38(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_0C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_0D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4C));
#endif
}

void MJENC_SetQTableOffset39(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_0E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_0F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_4E));
#endif
}

