sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_mjenc.c
void MJENC_SetQTableOffset40(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_50);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_10, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_11, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_50, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_50));
#endif
}

void MJENC_SetQTableOffset41(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_52);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_12, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_13, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_52, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_52));
#endif
}

void MJENC_SetQTableOffset42(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_54);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_14, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_15, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_54, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_54));
#endif
}

void MJENC_SetQTableOffset43(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_56);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_16, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_17, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_56, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_56));
#endif
}

void MJENC_SetQTableOffset44(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_58);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_18, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_19, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_58, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_58));
#endif
}

void MJENC_SetQTableOffset45(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_1A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_1B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5A));
#endif
}

void MJENC_SetQTableOffset46(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_1C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_1D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5C));
#endif
}

void MJENC_SetQTableOffset47(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_1E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_1F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_5E));
#endif
}

void MJENC_SetQTableOffset48(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_60);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_20, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_21, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_60, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_60));
#endif
}

void MJENC_SetQTableOffset49(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_62);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_22, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_23, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_62, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_62));
#endif
}

void MJENC_SetQTableOffset50(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_64);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_24, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_25, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_64, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_64));
#endif
}

void MJENC_SetQTableOffset51(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_66);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_26, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_27, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_66, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_66));
#endif
}

void MJENC_SetQTableOffset52(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_68);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_28, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_29, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_68, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_68));
#endif
}

void MJENC_SetQTableOffset53(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_2A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_2B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6A));
#endif
}

void MJENC_SetQTableOffset54(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_2C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_2D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6C));
#endif
}

void MJENC_SetQTableOffset55(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_2E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_2F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_6E));
#endif
}

void MJENC_SetQTableOffset56(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_70);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_30, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_31, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_70, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_70));
#endif
}

