sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_mjenc.c
void MJENC_SetQTableOffset57(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_72);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_32, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_33, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_72, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_72));
#endif
}

void MJENC_SetQTableOffset58(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_74);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_34, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_35, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_74, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_74));
#endif
}

void MJENC_SetQTableOffset59(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_76);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_36, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_37, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_76, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_76));
#endif
}

void MJENC_SetQTableOffset60(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_78);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_38, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_39, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_78, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_78));
#endif
}

void MJENC_SetQTableOffset61(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_3A, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_3B, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7A, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7A));
#endif
}

void MJENC_SetQTableOffset62(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_3C, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_3D, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7C, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7C));
#endif
}

void MJENC_SetQTableOffset63(int val1, int val2)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7E);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_3E, val1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_Q_SRAM_REG_Q_1_3F, val2);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7E, tmpVal);
#ifdef DEBUG_QTABLE
    MJENC_Qtable_debug(BL_RD_REG(MJPEG_ENC_BASE, MJENC_Q_SRAM_MJPEG_Q_PARAM_7E));
#endif
}

uint8_t MJENC_GetQTableCurrentBufIndex()
{
    uint32_t tmpVal;
    uint8_t index;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_Q_ENC);
    index = BL_GET_REG_BITS_VAL(tmpVal, MJENC_STS_Q_SRAM_ENC);

    return index;
}

void MJENC_EnableQTable()
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_Q_ENC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJENC_REG_Q_SRAM_SW, 0x1);
    BL_WR_REG(MJPEG_ENC_BASE, MJENC_MJPEG_Q_ENC, tmpVal);
}

uint32_t MJENC_Get_Int_Status(void)
{
    uint32_t tmpVal;
    uint32_t ret = 0;

    tmpVal = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_CONTROL_3);
    MJENC_ClearIntrFlag();

    if (BL_IS_REG_BIT_SET(tmpVal, MJENC_STS_NORMAL_INT)) {
        ret = BL_BIT_SET(ret, MJPEG_ENC_INT_NORMAL);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJENC_STS_CAM_INT)) {
        ret = BL_BIT_SET(ret, MJPEG_ENC_INT_CAM);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJENC_STS_MEM_INT)) {
        ret = BL_BIT_SET(ret, MJPEG_ENC_INT_MEM);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJENC_STS_FRAME_INT)) {
        ret = BL_BIT_SET(ret, MJPEG_ENC_INT_FRAME);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJENC_STS_IDLE_INT)) {
        ret = BL_BIT_SET(ret, MJPEG_ENC_INT_IDLE);
    }
 
    return ret;
}

void MJENC_Get_Frame(uint8_t **ptr, uint32_t *len)
{
    *len = BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_BIT_CNT0);
#if __riscv_xlen == 64
    *ptr = (uint8_t *)(uint64_t)BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_START_ADDR0);
#else
    *ptr = (uint8_t *)BL_RD_REG(MJPEG_ENC_BASE, MJENC_MJPEG_START_ADDR0);
#endif
}
